[
    "Succession, American comedy-drama television series created by British writer and producer Jesse Armstrong that aired on HBO from 2018 to 2023. The series focuses on the Roy family, whose aging patriarch, Logan Roy, owns the entertainment and media conglomerate Waystar Royco, one of the last surviving legacy media concerns, and struggles to pick a successor from among his power-hungry children, advisers, and investors. While Roy reluctantly acknowledges the need to choose a successor, he cannot seem to find one that satisfies both his desire to maintain family control over his company and to leave his life’s work to someone as mercilessly ambitious as he is.",
    "Widely praised for its imaginative profanity-laden dialogue, its prismatic classical music score by Nicholas Britell, and masterful performances by a cast of seasoned actors, Succession follows cutthroat corporate maneuverings and personal betrayals as almost everyone around Roy competes to succeed him.",
    "Cast and characters",
    "Succession",
    "SuccessionActors Jeremy Strong (left) and Alan Ruck portraying Kendall and Connor Roy in Succession (2018–23).",
    "Continuing HBO’s penchant for popularizing some of television’s most notorious antiheroes (such as in The Sopranos, The Wire, and Game of Thrones), Succession is a show with virtually no “good guys.” The series has garnered praise for its nuanced characters, who are deeply flawed, often selfish and cruel, and yet not completely unsympathetic to viewers.",
    "Iron-fisted billionaire Logan Roy, played by Scottish actor Brian Cox, has raised his four children within family dynamics defined by extravagant wealth, scarcity of affection, and constant competition. Having grown up poor and survived familial abuse throughout his childhood in Scotland only to move to the United States and become one of the country’s most powerful and influential individuals, Logan sought to give his children the comfort and amenities he never had and to raise them to be as hard-boiled and resourceful as he is. At the start of the series, as Logan turns 80 years old, he seems utterly unsatisfied with the results of his parenting.",
    "His children desperately seek his approval, which mires them in the paradox that Logan would never give his respect to anyone so desirous of it. His eldest son, Connor Roy, played by American actor Alan Ruck, attempts to stay out of the fray, on his ranch in New Mexico, consumed by his comical Libertarian-leaning U.S. presidential run. Although he appears in some ways to be the natural choice to assume control of Waystar, Kendall Roy, Logan’s first child from his second marriage, played by American actor Jeremy Strong, also suffers from delusions of grandeur, as he appears to consider himself a more cunning and capable corporate operative than he proves to be. He struggles with substance use disorder, the aftermath of a painful divorce, and his father’s apparent low regard for him, but he persists in his efforts to become the successor.",
    "Succession",
    "SuccessionNicholas Braun (left) and Matthew Macfadyen in the television series Succession (2018–23).",
    "Siobhan (“Shiv”) Roy, played by Australian actress Sarah Snook, at first seems driven to find success outside the family confines as a political consultant but eventually owns up to her desire to take the reins at Waystar. She keeps everyone, including her husband, at an emotional distance. Logan’s youngest child, Roman Roy, played by American actor Kieran Culkin, seems to be the underdog in the filial power struggle. Sarcastic and vulgar, Roman is terrified of vulnerability and seems to lack the courage to defy his father. The family is rounded out by Shiv’s obsequious, social-climbing husband, Tom Wambsgans, a Midwestern transplant played by British actor Matthew Macfadyen, and the Roy children’s cousin Greg Hirsch, who is alternatingly a bumbling fool and an enterprising sycophant, portrayed by American actor Nicholas Braun.",
    "Despite their lavish wealth, the Roys’ world often appears unmistakably joyless, which is reflected in the show’s sterile, impersonal settings and bland design choices. Although the Roys derive such little pleasure or satisfaction from their wealth, “For these people to be excluded from the flame of money and power, I think, would feel a bit like death,” creator Armstrong told The New Yorker magazine in 2021.",
    "Access for the whole family!",
    "Bundle Britannica Premium and Kids for the ultimate resource destination.",
    "Real-life inspiration",
    "Napoleonic succession, Succession style",
    "Napoleonic succession, Succession styleNapoleon I, emperor of the French, is one of the most celebrated personages in the history of the West.",
    "See all videos for this article",
    "Although Armstrong claims that his portrait of the Roys was influenced by many different famous media family dynasties, including the Redstones, the Hearsts, and the Mercers, much attention has been paid to the similarities between Logan Roy’s family and that of Rupert Murdoch, the Australian-born American media mogul and founder of Fox News.",
    "In a 2023 article for The Guardian, Armstrong described some of the characteristics and personality traits shared by the media moguls after whom he modeled Logan Roy: “They were connected by a strong interest in a few things: a refusal to think about mortality…; desire for control; manic deal-making energy; love of gossip and power-connection; a certain ruthlessness about hirings and firings. And most of all, an instinct for forward motion, with a notable lack of introspection.”",
    "Critical reception",
    "Although Succession has drawn fewer viewers than HBO’s most popular shows, it has received extensive critical attention from national outlets covering news and culture. In 2023 reporting on media trends found that Succession spawned six times as many online articles in one 30-day period in summer 2023 as any other highly watched television show and seemed to confirm that Succession sparked outsized media coverage compared with reader interest. Some critics have speculated that the media’s fascination with the show stems from its own involvement in the volatile and sometimes toxic media industry that the show portrays."
]